dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rfrxdn_dly1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXDN_DLY1_ADDR, value);
}

// field definitions
#define RPL_RX_DN_DLY5_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_DN_DLY5_LSB    22
#define RPL_RX_DN_DLY5_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY4_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_DN_DLY4_LSB    11
#define RPL_RX_DN_DLY4_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY3_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_DN_DLY3_LSB    0
#define RPL_RX_DN_DLY3_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_DN_DLY5_RST    0x1
#define RPL_RX_DN_DLY4_RST    0x1
#define RPL_RX_DN_DLY3_RST    0x1

__STATIC_FORCEINLINE void rpl_rfrxdn_dly1_pack(uint16_t rxdndly5, uint16_t rxdndly4, uint16_t rxdndly3)
{
    ASSERT_ERR((((uint32_t)rxdndly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY1_ADDR,  ((uint32_t)rxdndly5 << 22) | ((uint32_t)rxdndly4 << 11) | ((uint32_t)rxdndly3 << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxdn_dly1_unpack(uint16_t* rxdndly5, uint16_t* rxdndly4, uint16_t* rxdndly3)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR);

    *rxdndly5 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxdndly4 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxdndly3 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly5_setf(uint16_t rxdndly5)
{
    ASSERT_ERR((((uint32_t)rxdndly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxdndly5 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly4_setf(uint16_t rxdndly4)
{
    ASSERT_ERR((((uint32_t)rxdndly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxdndly4 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly3_setf(uint16_t rxdndly3)
{
    ASSERT_ERR((((uint32_t)rxdndly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxdndly3 << 0));
}

/**
 * @brief RFRXDN_DLY2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_DN_DLY8   0x1
 *  20:11           RX_DN_DLY7   0x1
 *  09:00           RX_DN_DLY6   0x1
 * </pre>
 */
#define RPL_RFRXDN_DLY2_ADDR   0x0000000E
#define RPL_RFRXDN_DLY2_OFFSET 0x0000000E
#define RPL_RFRXDN_DLY2_INDEX  0x0000000E
#define RPL_RFRXDN_DLY2_RESET  0x00400801

__STATIC_FORCEINLINE uint32_t rpl_rfrxdn_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfrxdn_dly2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXDN_DLY2_ADDR, value);
}

// field definitions
#define RPL_RX_DN_DLY8_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_DN_DLY8_LSB    22
#define RPL_RX_DN_DLY8_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY7_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_DN_DLY7_LSB    11
#define RPL_RX_DN_DLY7_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY6_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_DN_DLY6_LSB    0
#define RPL_RX_DN_DLY6_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_DN_DLY8_RST    0x1
#define RPL_RX_DN_DLY7_RST    0x1
#define RPL_RX_DN_DLY6_RST    0x1

__STATIC_FORCEINLINE void rpl_rfrxdn_dly2_pack(uint16_t rxdndly8, uint16_t rxdndly7, uint16_t rxdndly6)
{
    ASSERT_ERR((((uint32_t)rxdndly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY2_ADDR,  ((uint32_t)rxdndly8 << 22) | ((uint32_t)rxdndly7 << 11) | ((uint32_t)rxdndly6 << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxdn_dly2_unpack(uint16_t* rxdndly8, uint16_t* rxdndly7, uint16_t* rxdndly6)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR);

    *rxdndly8 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxdndly7 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxdndly6 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly8_setf(uint16_t rxdndly8)
{
    ASSERT_ERR((((uint32_t)rxdndly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxdndly8 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly7_setf(uint16_t rxdndly7)
{
    ASSERT_ERR((((uint32_t)rxdndly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxdndly7 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly6_setf(uint16_t rxdndly6)
{
    ASSERT_ERR((((uint32_t)rxdndly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY2_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxdndly6 << 0));
}

/**
 * @brief SEQTXUP_OUT0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_UP_OUT2   0x7
 *  19:11           TX_UP_OUT1   0x3
 *  08:00           TX_UP_OUT0   0x1
 * </pre>
 */
#define RPL_SEQTXUP_OUT0_ADDR   0x0000000F
#define RPL_SEQTXUP_OUT0_OFFSET 0x0000000F
#define RPL_SEQTXUP_OUT0_INDEX  0x0000000F
#define RPL_SEQTXUP_OUT0_RESET  0x01C01801

