dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_TX_UP_OUT8_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_UP_OUT8_LSB    22
#define RPL_TX_UP_OUT8_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT7_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_UP_OUT7_LSB    11
#define RPL_TX_UP_OUT7_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT6_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_UP_OUT6_LSB    0
#define RPL_TX_UP_OUT6_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_UP_OUT8_RST    0x1F
#define RPL_TX_UP_OUT7_RST    0x1F
#define RPL_TX_UP_OUT6_RST    0x1F

__STATIC_FORCEINLINE void rpl_seqtxup_out2_pack(uint16_t txupout8, uint16_t txupout7, uint16_t txupout6)
{
    ASSERT_ERR((((uint32_t)txupout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT2_ADDR,  ((uint32_t)txupout8 << 22) | ((uint32_t)txupout7 << 11) | ((uint32_t)txupout6 << 0));
}

__STATIC_FORCEINLINE void rpl_seqtxup_out2_unpack(uint16_t* txupout8, uint16_t* txupout7, uint16_t* txupout6)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR);

    *txupout8 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txupout7 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txupout6 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_out8_setf(uint16_t txupout8)
{
    ASSERT_ERR((((uint32_t)txupout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txupout8 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_out7_setf(uint16_t txupout7)
{
    ASSERT_ERR((((uint32_t)txupout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txupout7 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_up_out6_setf(uint16_t txupout6)
{
    ASSERT_ERR((((uint32_t)txupout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txupout6 << 0));
}

/**
 * @brief SEQTXDN_OUT0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_DN_OUT2   0x3
 *  19:11           TX_DN_OUT1   0x7
 *  08:00           TX_DN_OUT0   0xF
 * </pre>
 */
#define RPL_SEQTXDN_OUT0_ADDR   0x00000012
#define RPL_SEQTXDN_OUT0_OFFSET 0x00000012
#define RPL_SEQTXDN_OUT0_INDEX  0x00000012
#define RPL_SEQTXDN_OUT0_RESET  0x00C0380F

__STATIC_FORCEINLINE uint32_t rpl_seqtxdn_out0_get(void)
{
    return REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR);
}

__STATIC_FORCEINLINE void rpl_seqtxdn_out0_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXDN_OUT0_ADDR, value);
}

// field definitions
#define RPL_TX_DN_OUT2_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_DN_OUT2_LSB    22
#define RPL_TX_DN_OUT2_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT1_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_DN_OUT1_LSB    11
#define RPL_TX_DN_OUT1_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT0_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_DN_OUT0_LSB    0
#define RPL_TX_DN_OUT0_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_DN_OUT2_RST    0x3
#define RPL_TX_DN_OUT1_RST    0x7
#define RPL_TX_DN_OUT0_RST    0xF

__STATIC_FORCEINLINE void rpl_seqtxdn_out0_pack(uint16_t txdnout2, uint16_t txdnout1, uint16_t txdnout0)
{
    ASSERT_ERR((((uint32_t)txdnout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdnout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdnout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT0_ADDR,  ((uint32_t)txdnout2 << 22) | ((uint32_t)txdnout1 << 11) | ((uint32_t)txdnout0 << 0));
}

__STATIC_FORCEINLINE void rpl_seqtxdn_out0_unpack(uint16_t* txdnout2, uint16_t* txdnout1, uint16_t* txdnout0)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR);

    *txdnout2 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txdnout1 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txdnout0 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_out2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_dn_out2_setf(uint16_t txdnout2)
{
    ASSERT_ERR((((uint32_t)txdnout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txdnout2 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_out1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_dn_out1_setf(uint16_t txdnout1)
{
    ASSERT_ERR((((uint32_t)txdnout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txdnout1 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_out0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_dn_out0_setf(uint16_t txdnout0)
{
    ASSERT_ERR((((uint32_t)txdnout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT0_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txdnout0 << 0));
}

/**
 * @brief SEQTXDN_OUT1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_DN_OUT5   0x0
 *  19:11           TX_DN_OUT4   0x0
 *  08:00           TX_DN_OUT3   0x1
 * </pre>
 */
#define RPL_SEQTXDN_OUT1_ADDR   0x00000013
#define RPL_SEQTXDN_OUT1_OFFSET 0x00000013
#define RPL_SEQTXDN_OUT1_INDEX  0x00000013
#define RPL_SEQTXDN_OUT1_RESET  0x00000001

__STATIC_FORCEINLINE uint32_t rpl_seqtxdn_out1_get(void)
{
    return REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR);
}

__STATIC_FORCEINLINE void rpl_seqtxdn_out1_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXDN_OUT1_ADDR, value);
}

