dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rpll_vco_on_setf(uint8_t rpllvcoon)
{
    ASSERT_ERR((((uint32_t)rpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)rpllvcoon << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_cp_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_rpll_cp_on_setf(uint8_t rpllcpon)
{
    ASSERT_ERR((((uint32_t)rpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)rpllcpon << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_div_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rpll_div_on_setf(uint8_t rplldivon)
{
    ASSERT_ERR((((uint32_t)rplldivon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)rplldivon << 0));
}

/**
 * @brief RPLLCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:24   RPLL_IVCO_BUF_TRIM   0x0
 *     22   RPLL_VCOREFBACKUP_EN   0
 *     20            RPLL_NREF   1
 *  18:16         RPLL_CP_TEST   0x0
 *  14:12      RPLL_ICP_OFFSET   0x5
 *  11:08             RPLL_ICP   0x4
 *  07:04           RPLL_VCOFC   0x0
 *  03:02            RPLL_IVCO   0x3
 *  01:00        RPLL_VCO_MODE   0x0
 * </pre>
 */
#define RPL_RPLLCNTL1_ADDR   0x0000001D
#define RPL_RPLLCNTL1_OFFSET 0x0000001D
#define RPL_RPLLCNTL1_INDEX  0x0000001D
#define RPL_RPLLCNTL1_RESET  0x0010540C

__STATIC_FORCEINLINE uint32_t rpl_rpllcntl1_get(void)
{
    return REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
}

__STATIC_FORCEINLINE void rpl_rpllcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, value);
}

// field definitions
#define RPL_RPLL_IVCO_BUF_TRIM_MASK     ((uint32_t)0x03000000)
#define RPL_RPLL_IVCO_BUF_TRIM_LSB      24
#define RPL_RPLL_IVCO_BUF_TRIM_WIDTH    ((uint32_t)0x00000002)
#define RPL_RPLL_VCOREFBACKUP_EN_BIT    ((uint32_t)0x00400000)
#define RPL_RPLL_VCOREFBACKUP_EN_POS    22
#define RPL_RPLL_NREF_BIT               ((uint32_t)0x00100000)
#define RPL_RPLL_NREF_POS               20
#define RPL_RPLL_CP_TEST_MASK           ((uint32_t)0x00070000)
#define RPL_RPLL_CP_TEST_LSB            16
#define RPL_RPLL_CP_TEST_WIDTH          ((uint32_t)0x00000003)
#define RPL_RPLL_ICP_OFFSET_MASK        ((uint32_t)0x00007000)
#define RPL_RPLL_ICP_OFFSET_LSB         12
#define RPL_RPLL_ICP_OFFSET_WIDTH       ((uint32_t)0x00000003)
#define RPL_RPLL_ICP_MASK               ((uint32_t)0x00000F00)
#define RPL_RPLL_ICP_LSB                8
#define RPL_RPLL_ICP_WIDTH              ((uint32_t)0x00000004)
#define RPL_RPLL_VCOFC_MASK             ((uint32_t)0x000000F0)
#define RPL_RPLL_VCOFC_LSB              4
#define RPL_RPLL_VCOFC_WIDTH            ((uint32_t)0x00000004)
#define RPL_RPLL_IVCO_MASK              ((uint32_t)0x0000000C)
#define RPL_RPLL_IVCO_LSB               2
#define RPL_RPLL_IVCO_WIDTH             ((uint32_t)0x00000002)
#define RPL_RPLL_VCO_MODE_MASK          ((uint32_t)0x00000003)
#define RPL_RPLL_VCO_MODE_LSB           0
#define RPL_RPLL_VCO_MODE_WIDTH         ((uint32_t)0x00000002)

#define RPL_RPLL_IVCO_BUF_TRIM_RST      0x0
#define RPL_RPLL_VCOREFBACKUP_EN_RST    0x0
#define RPL_RPLL_NREF_RST               0x1
#define RPL_RPLL_CP_TEST_RST            0x0
#define RPL_RPLL_ICP_OFFSET_RST         0x5
#define RPL_RPLL_ICP_RST                0x4
#define RPL_RPLL_VCOFC_RST              0x0
#define RPL_RPLL_IVCO_RST               0x3
#define RPL_RPLL_VCO_MODE_RST           0x0

__STATIC_FORCEINLINE void rpl_rpllcntl1_pack(uint8_t rpllivcobuftrim, uint8_t rpllvcorefbackupen, uint8_t rpllnref, uint8_t rpllcptest, uint8_t rpllicpoffset, uint8_t rpllicp, uint8_t rpllvcofc, uint8_t rpllivco, uint8_t rpllvcomode)
{
    ASSERT_ERR((((uint32_t)rpllivcobuftrim << 24) & ~((uint32_t)0x03000000)) == 0);
    ASSERT_ERR((((uint32_t)rpllvcorefbackupen << 22) & ~((uint32_t)0x00400000)) == 0);
    ASSERT_ERR((((uint32_t)rpllnref << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)rpllcptest << 16) & ~((uint32_t)0x00070000)) == 0);
    ASSERT_ERR((((uint32_t)rpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    ASSERT_ERR((((uint32_t)rpllicp << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)rpllvcofc << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)rpllivco << 2) & ~((uint32_t)0x0000000C)) == 0);
    ASSERT_ERR((((uint32_t)rpllvcomode << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR,  ((uint32_t)rpllivcobuftrim << 24) | ((uint32_t)rpllvcorefbackupen << 22) | ((uint32_t)rpllnref << 20) | ((uint32_t)rpllcptest << 16) | ((uint32_t)rpllicpoffset << 12) | ((uint32_t)rpllicp << 8) | ((uint32_t)rpllvcofc << 4) | ((uint32_t)rpllivco << 2) | ((uint32_t)rpllvcomode << 0));
}

__STATIC_FORCEINLINE void rpl_rpllcntl1_unpack(uint8_t* rpllivcobuftrim, uint8_t* rpllvcorefbackupen, uint8_t* rpllnref, uint8_t* rpllcptest, uint8_t* rpllicpoffset, uint8_t* rpllicp, uint8_t* rpllvcofc, uint8_t* rpllivco, uint8_t* rpllvcomode)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);

    *rpllivcobuftrim = (localVal & ((uint32_t)0x03000000)) >> 24;
    *rpllvcorefbackupen = (localVal & ((uint32_t)0x00400000)) >> 22;
    *rpllnref = (localVal & ((uint32_t)0x00100000)) >> 20;
    *rpllcptest = (localVal & ((uint32_t)0x00070000)) >> 16;
    *rpllicpoffset = (localVal & ((uint32_t)0x00007000)) >> 12;
    *rpllicp = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *rpllvcofc = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *rpllivco = (localVal & ((uint32_t)0x0000000C)) >> 2;
    *rpllvcomode = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_ivco_buf_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_rpll_ivco_buf_trim_setf(uint8_t rpllivcobuftrim)
{
    ASSERT_ERR((((uint32_t)rpllivcobuftrim << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x03000000)) | ((uint32_t)rpllivcobuftrim << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_vcorefbackup_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_rpll_vcorefbackup_en_setf(uint8_t rpllvcorefbackupen)
{
    ASSERT_ERR((((uint32_t)rpllvcorefbackupen << 22) & ~((uint32_t)0x00400000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00400000)) | ((uint32_t)rpllvcorefbackupen << 22));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_nref_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_rpll_nref_setf(uint8_t rpllnref)
{
    ASSERT_ERR((((uint32_t)rpllnref << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)rpllnref << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_cp_test_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_rpll_cp_test_setf(uint8_t rpllcptest)
{
    ASSERT_ERR((((uint32_t)rpllcptest << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)rpllcptest << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_icp_offset_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

