dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_DPLL_DIVR_MASK     ((uint32_t)0x30000000)
#define RPL_DPLL_DIVR_LSB      28
#define RPL_DPLL_DIVR_WIDTH    ((uint32_t)0x00000002)
#define RPL_DPLL_DIVP_MASK     ((uint32_t)0x07000000)
#define RPL_DPLL_DIVP_LSB      24
#define RPL_DPLL_DIVP_WIDTH    ((uint32_t)0x00000003)
#define RPL_DPLL_NFRACT_MASK   ((uint32_t)0x00FFFF00)
#define RPL_DPLL_NFRACT_LSB    8
#define RPL_DPLL_NFRACT_WIDTH  ((uint32_t)0x00000010)
#define RPL_DPLL_NINT_MASK     ((uint32_t)0x0000001F)
#define RPL_DPLL_NINT_LSB      0
#define RPL_DPLL_NINT_WIDTH    ((uint32_t)0x00000005)

#define RPL_DPLL_DIVR_RST      0x0
#define RPL_DPLL_DIVP_RST      0x0
#define RPL_DPLL_NFRACT_RST    0x0
#define RPL_DPLL_NINT_RST      0x0

__STATIC_FORCEINLINE void rpl_dpllcntl1_pack(uint8_t dplldivr, uint8_t dplldivp, uint16_t dpllnfract, uint8_t dpllnint)
{
    ASSERT_ERR((((uint32_t)dplldivr << 28) & ~((uint32_t)0x30000000)) == 0);
    ASSERT_ERR((((uint32_t)dplldivp << 24) & ~((uint32_t)0x07000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllnfract << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    ASSERT_ERR((((uint32_t)dpllnint << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR,  ((uint32_t)dplldivr << 28) | ((uint32_t)dplldivp << 24) | ((uint32_t)dpllnfract << 8) | ((uint32_t)dpllnint << 0));
}

__STATIC_FORCEINLINE void rpl_dpllcntl1_unpack(uint8_t* dplldivr, uint8_t* dplldivp, uint16_t* dpllnfract, uint8_t* dpllnint)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);

    *dplldivr = (localVal & ((uint32_t)0x30000000)) >> 28;
    *dplldivp = (localVal & ((uint32_t)0x07000000)) >> 24;
    *dpllnfract = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *dpllnint = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_divr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

__STATIC_FORCEINLINE void rpl_dpll_divr_setf(uint8_t dplldivr)
{
    ASSERT_ERR((((uint32_t)dplldivr << 28) & ~((uint32_t)0x30000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x30000000)) | ((uint32_t)dplldivr << 28));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_divp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_dpll_divp_setf(uint8_t dplldivp)
{
    ASSERT_ERR((((uint32_t)dplldivp << 24) & ~((uint32_t)0x07000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x07000000)) | ((uint32_t)dplldivp << 24));
}

__STATIC_FORCEINLINE uint16_t rpl_dpll_nfract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_dpll_nfract_setf(uint16_t dpllnfract)
{
    ASSERT_ERR((((uint32_t)dpllnfract << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x00FFFF00)) | ((uint32_t)dpllnfract << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_nint_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__STATIC_FORCEINLINE void rpl_dpll_nint_setf(uint8_t dpllnint)
{
    ASSERT_ERR((((uint32_t)dpllnint << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)dpllnint << 0));
}

/**
 * @brief DPLLCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:16         DPLL_SDORDER   0x1
 *  14:12      DPLL_ICP_OFFSET   0x0
 *     11         DPLL_VCO_CFG   0
 *  10:08         DPLL_PFD_CFG   0x0
 *  07:04             DPLL_ICP   0x0
 *     03         DPLL_TEST_EN   0
 *     02   DPLL_VCO_SPEEDUP_EN   0
 *     01        DPLL_FRACT_EN   0
 *     00          DPLL_DTP_EN   0
 * </pre>
 */
#define RPL_DPLLCNTL2_ADDR   0x00000034
#define RPL_DPLLCNTL2_OFFSET 0x00000034
#define RPL_DPLLCNTL2_INDEX  0x00000034
#define RPL_DPLLCNTL2_RESET  0x00010000

__STATIC_FORCEINLINE uint32_t rpl_dpllcntl2_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
}

__STATIC_FORCEINLINE void rpl_dpllcntl2_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, value);
}

// field definitions
#define RPL_DPLL_SDORDER_MASK          ((uint32_t)0x00030000)
#define RPL_DPLL_SDORDER_LSB           16
#define RPL_DPLL_SDORDER_WIDTH         ((uint32_t)0x00000002)
#define RPL_DPLL_ICP_OFFSET_MASK       ((uint32_t)0x00007000)
#define RPL_DPLL_ICP_OFFSET_LSB        12
#define RPL_DPLL_ICP_OFFSET_WIDTH      ((uint32_t)0x00000003)
#define RPL_DPLL_VCO_CFG_BIT           ((uint32_t)0x00000800)
#define RPL_DPLL_VCO_CFG_POS           11
#define RPL_DPLL_PFD_CFG_MASK          ((uint32_t)0x00000700)
#define RPL_DPLL_PFD_CFG_LSB           8
#define RPL_DPLL_PFD_CFG_WIDTH         ((uint32_t)0x00000003)
#define RPL_DPLL_ICP_MASK              ((uint32_t)0x000000F0)
#define RPL_DPLL_ICP_LSB               4
#define RPL_DPLL_ICP_WIDTH             ((uint32_t)0x00000004)
#define RPL_DPLL_TEST_EN_BIT           ((uint32_t)0x00000008)
#define RPL_DPLL_TEST_EN_POS           3
#define RPL_DPLL_VCO_SPEEDUP_EN_BIT    ((uint32_t)0x00000004)
#define RPL_DPLL_VCO_SPEEDUP_EN_POS    2
#define RPL_DPLL_FRACT_EN_BIT          ((uint32_t)0x00000002)
#define RPL_DPLL_FRACT_EN_POS          1
#define RPL_DPLL_DTP_EN_BIT            ((uint32_t)0x00000001)
#define RPL_DPLL_DTP_EN_POS            0

#define RPL_DPLL_SDORDER_RST           0x1
#define RPL_DPLL_ICP_OFFSET_RST        0x0
#define RPL_DPLL_VCO_CFG_RST           0x0
#define RPL_DPLL_PFD_CFG_RST           0x0
#define RPL_DPLL_ICP_RST               0x0
#define RPL_DPLL_TEST_EN_RST           0x0
#define RPL_DPLL_VCO_SPEEDUP_EN_RST    0x0
#define RPL_DPLL_FRACT_EN_RST          0x0
#define RPL_DPLL_DTP_EN_RST            0x0

__STATIC_FORCEINLINE void rpl_dpllcntl2_pack(uint8_t dpllsdorder, uint8_t dpllicpoffset, uint8_t dpllvcocfg, uint8_t dpllpfdcfg, uint8_t dpllicp, uint8_t dplltesten, uint8_t dpllvcospeedupen, uint8_t dpllfracten, uint8_t dplldtpen)
{
    ASSERT_ERR((((uint32_t)dpllsdorder << 16) & ~((uint32_t)0x00030000)) == 0);
    ASSERT_ERR((((uint32_t)dpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcocfg << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)dpllpfdcfg << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)dpllicp << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)dplltesten << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcospeedupen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dpllfracten << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dplldtpen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR,  ((uint32_t)dpllsdorder << 16) | ((uint32_t)dpllicpoffset << 12) | ((uint32_t)dpllvcocfg << 11) | ((uint32_t)dpllpfdcfg << 8) | ((uint32_t)dpllicp << 4) | ((uint32_t)dplltesten << 3) | ((uint32_t)dpllvcospeedupen << 2) | ((uint32_t)dpllfracten << 1) | ((uint32_t)dplldtpen << 0));
}

__STATIC_FORCEINLINE void rpl_dpllcntl2_unpack(uint8_t* dpllsdorder, uint8_t* dpllicpoffset, uint8_t* dpllvcocfg, uint8_t* dpllpfdcfg, uint8_t* dpllicp, uint8_t* dplltesten, uint8_t* dpllvcospeedupen, uint8_t* dpllfracten, uint8_t* dplldtpen)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);

    *dpllsdorder = (localVal & ((uint32_t)0x00030000)) >> 16;
    *dpllicpoffset = (localVal & ((uint32_t)0x00007000)) >> 12;
    *dpllvcocfg = (localVal & ((uint32_t)0x00000800)) >> 11;
    *dpllpfdcfg = (localVal & ((uint32_t)0x00000700)) >> 8;
    *dpllicp = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *dplltesten = (localVal & ((uint32_t)0x00000008)) >> 3;
    *dpllvcospeedupen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dpllfracten = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dplldtpen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_sdorder_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_dpll_sdorder_setf(uint8_t dpllsdorder)
{
    ASSERT_ERR((((uint32_t)dpllsdorder << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00030000)) | ((uint32_t)dpllsdorder << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_icp_offset_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_dpll_icp_offset_setf(uint8_t dpllicpoffset)
{
    ASSERT_ERR((((uint32_t)dpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)dpllicpoffset << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_vco_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

