dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rpll_rccal_clk_en_setf(uint8_t rpllrccalclken)
{
    ASSERT_ERR((((uint32_t)rpllrccalclken << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)rpllrccalclken << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_rccal_clk_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_dpll_rccal_clk_en_setf(uint8_t dpllrccalclken)
{
    ASSERT_ERR((((uint32_t)dpllrccalclken << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)dpllrccalclken << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_filt_rccal_nosc_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_filt_rccal_nosc_setf(uint8_t filtrccalnosc)
{
    ASSERT_ERR((((uint32_t)filtrccalnosc << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)filtrccalnosc << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_rccal_nosc_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__STATIC_FORCEINLINE void rpl_rpll_rccal_nosc_setf(uint8_t rpllrccalnosc)
{
    ASSERT_ERR((((uint32_t)rpllrccalnosc << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)rpllrccalnosc << 7));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_rccal_nosc_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_FORCEINLINE void rpl_dpll_rccal_nosc_setf(uint8_t dpllrccalnosc)
{
    ASSERT_ERR((((uint32_t)dpllrccalnosc << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)dpllrccalnosc << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_filt_rccal_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void rpl_filt_rccal_on_setf(uint8_t filtrccalon)
{
    ASSERT_ERR((((uint32_t)filtrccalon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)filtrccalon << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_rccal_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_rpll_rccal_on_setf(uint8_t rpllrccalon)
{
    ASSERT_ERR((((uint32_t)rpllrccalon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)rpllrccalon << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_rccal_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_dpll_rccal_on_setf(uint8_t dpllrccalon)
{
    ASSERT_ERR((((uint32_t)dpllrccalon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)dpllrccalon << 0));
}

/**
 * @brief PLL_RC_CALIB_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:20   RPLL_RCCAL_BTUNESTAT   0x0
 *     16      RPLL_RCCAL_DONE   0
 *  13:04   DPLL_RCCAL_BTUNESTAT   0x0
 *     00      DPLL_RCCAL_DONE   0
 * </pre>
 */
#define RPL_PLL_RC_CALIB_STAT_ADDR   0x00000038
#define RPL_PLL_RC_CALIB_STAT_OFFSET 0x00000038
#define RPL_PLL_RC_CALIB_STAT_INDEX  0x00000038
#define RPL_PLL_RC_CALIB_STAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_pll_rc_calib_stat_get(void)
{
    return REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
}

// field definitions
#define RPL_RPLL_RCCAL_BTUNESTAT_MASK   ((uint32_t)0x3FF00000)
#define RPL_RPLL_RCCAL_BTUNESTAT_LSB    20
#define RPL_RPLL_RCCAL_BTUNESTAT_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RPLL_RCCAL_DONE_BIT         ((uint32_t)0x00010000)
#define RPL_RPLL_RCCAL_DONE_POS         16
#define RPL_DPLL_RCCAL_BTUNESTAT_MASK   ((uint32_t)0x00003FF0)
#define RPL_DPLL_RCCAL_BTUNESTAT_LSB    4
#define RPL_DPLL_RCCAL_BTUNESTAT_WIDTH  ((uint32_t)0x0000000A)
#define RPL_DPLL_RCCAL_DONE_BIT         ((uint32_t)0x00000001)
#define RPL_DPLL_RCCAL_DONE_POS         0

#define RPL_RPLL_RCCAL_BTUNESTAT_RST    0x0
#define RPL_RPLL_RCCAL_DONE_RST         0x0
#define RPL_DPLL_RCCAL_BTUNESTAT_RST    0x0
#define RPL_DPLL_RCCAL_DONE_RST         0x0

__STATIC_FORCEINLINE void rpl_pll_rc_calib_stat_unpack(uint16_t* rpllrccalbtunestat, uint8_t* rpllrccaldone, uint16_t* dpllrccalbtunestat, uint8_t* dpllrccaldone)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);

    *rpllrccalbtunestat = (localVal & ((uint32_t)0x3FF00000)) >> 20;
    *rpllrccaldone = (localVal & ((uint32_t)0x00010000)) >> 16;
    *dpllrccalbtunestat = (localVal & ((uint32_t)0x00003FF0)) >> 4;
    *dpllrccaldone = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_rpll_rccal_btunestat_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x3FF00000)) >> 20);
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_rccal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__STATIC_FORCEINLINE uint16_t rpl_dpll_rccal_btunestat_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00003FF0)) >> 4);
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_rccal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief FILTER_RC_CALIB_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:04   FILT_RCCAL_BTUNESTAT   0x0
 *     00      FILT_RCCAL_DONE   0
 * </pre>
 */
#define RPL_FILTER_RC_CALIB_STAT_ADDR   0x00000039
#define RPL_FILTER_RC_CALIB_STAT_OFFSET 0x00000039
#define RPL_FILTER_RC_CALIB_STAT_INDEX  0x00000039
#define RPL_FILTER_RC_CALIB_STAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_filter_rc_calib_stat_get(void)
{
    return REG_RPL_RD(RPL_FILTER_RC_CALIB_STAT_ADDR);
}

