dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_EPC_MODE_MASK         ((uint32_t)0xC0000000)
#define RPL_EPC_MODE_LSB          30
#define RPL_EPC_MODE_WIDTH        ((uint32_t)0x00000002)
#define RPL_EDR_SWITCH_CNT_MASK   ((uint32_t)0x1FF00000)
#define RPL_EDR_SWITCH_CNT_LSB    20
#define RPL_EDR_SWITCH_CNT_WIDTH  ((uint32_t)0x00000009)
#define RPL_GAIN_DEC_MASK         ((uint32_t)0x0000FF00)
#define RPL_GAIN_DEC_LSB          8
#define RPL_GAIN_DEC_WIDTH        ((uint32_t)0x00000008)
#define RPL_GAIN_INCR_MASK        ((uint32_t)0x000000FF)
#define RPL_GAIN_INCR_LSB         0
#define RPL_GAIN_INCR_WIDTH       ((uint32_t)0x00000008)

#define RPL_EPC_MODE_RST          0x0
#define RPL_EDR_SWITCH_CNT_RST    0xD9
#define RPL_GAIN_DEC_RST          0x1
#define RPL_GAIN_INCR_RST         0x1

__STATIC_FORCEINLINE void rpl_rampgencntl_pack(uint8_t epcmode, uint16_t edrswitchcnt, uint8_t gaindec, uint8_t gainincr)
{
    ASSERT_ERR((((uint32_t)epcmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    ASSERT_ERR((((uint32_t)edrswitchcnt << 20) & ~((uint32_t)0x1FF00000)) == 0);
    ASSERT_ERR((((uint32_t)gaindec << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)gainincr << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR,  ((uint32_t)epcmode << 30) | ((uint32_t)edrswitchcnt << 20) | ((uint32_t)gaindec << 8) | ((uint32_t)gainincr << 0));
}

__STATIC_FORCEINLINE void rpl_rampgencntl_unpack(uint8_t* epcmode, uint16_t* edrswitchcnt, uint8_t* gaindec, uint8_t* gainincr)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);

    *epcmode = (localVal & ((uint32_t)0xC0000000)) >> 30;
    *edrswitchcnt = (localVal & ((uint32_t)0x1FF00000)) >> 20;
    *gaindec = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *gainincr = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_epc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0xC0000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_epc_mode_setf(uint8_t epcmode)
{
    ASSERT_ERR((((uint32_t)epcmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0xC0000000)) | ((uint32_t)epcmode << 30));
}

__STATIC_FORCEINLINE uint16_t rpl_edr_switch_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x1FF00000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_edr_switch_cnt_setf(uint16_t edrswitchcnt)
{
    ASSERT_ERR((((uint32_t)edrswitchcnt << 20) & ~((uint32_t)0x1FF00000)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x1FF00000)) | ((uint32_t)edrswitchcnt << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_gain_dec_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_gain_dec_setf(uint8_t gaindec)
{
    ASSERT_ERR((((uint32_t)gaindec << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)gaindec << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_gain_incr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_gain_incr_setf(uint8_t gainincr)
{
    ASSERT_ERR((((uint32_t)gainincr << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)gainincr << 0));
}

/**
 * @brief RFTX_GFSK_GAIN_TABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:08   TX_GFSK_PAINT_GAIN   0x0
 *  06:04     TX_GFSK_DRV_GAIN   0x1
 *  02:00   TX_GFSK_FILTER_GAIN   0x3
 * </pre>
 */
#define RPL_RFTX_GFSK_GAIN_TABLE_ADDR   0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_OFFSET 0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_INDEX  0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_RESET  0x00000013
#define RPL_RFTX_GFSK_GAIN_TABLE_COUNT  16

__STATIC_FORCEINLINE uint32_t rpl_rftx_gfsk_gain_table_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    return REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
}

__STATIC_FORCEINLINE void rpl_rftx_gfsk_gain_table_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 15);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_TX_GFSK_PAINT_GAIN_MASK    ((uint32_t)0x00000700)
#define RPL_TX_GFSK_PAINT_GAIN_LSB     8
#define RPL_TX_GFSK_PAINT_GAIN_WIDTH   ((uint32_t)0x00000003)
#define RPL_TX_GFSK_DRV_GAIN_MASK      ((uint32_t)0x00000070)
#define RPL_TX_GFSK_DRV_GAIN_LSB       4
#define RPL_TX_GFSK_DRV_GAIN_WIDTH     ((uint32_t)0x00000003)
#define RPL_TX_GFSK_FILTER_GAIN_MASK   ((uint32_t)0x00000007)
#define RPL_TX_GFSK_FILTER_GAIN_LSB    0
#define RPL_TX_GFSK_FILTER_GAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_TX_GFSK_PAINT_GAIN_RST     0x0
#define RPL_TX_GFSK_DRV_GAIN_RST       0x1
#define RPL_TX_GFSK_FILTER_GAIN_RST    0x3

__STATIC_FORCEINLINE void rpl_rftx_gfsk_gain_table_pack(int reg_idx, uint8_t txgfskpaintgain, uint8_t txgfskdrvgain, uint8_t txgfskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)txgfskdrvgain << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)txgfskfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1,  ((uint32_t)txgfskpaintgain << 8) | ((uint32_t)txgfskdrvgain << 4) | ((uint32_t)txgfskfiltergain << 0));
}

__STATIC_FORCEINLINE void rpl_rftx_gfsk_gain_table_unpack(int reg_idx, uint8_t* txgfskpaintgain, uint8_t* txgfskdrvgain, uint8_t* txgfskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);

    *txgfskpaintgain = (localVal & ((uint32_t)0x00000700)) >> 8;
    *txgfskdrvgain = (localVal & ((uint32_t)0x00000070)) >> 4;
    *txgfskfiltergain = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_tx_gfsk_paint_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__STATIC_FORCEINLINE void rpl_tx_gfsk_paint_gain_setf(int reg_idx, uint8_t txgfskpaintgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000700)) | ((uint32_t)txgfskpaintgain << 8));
}

