dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_txdacq_8dpsk_gain_setf(uint8_t txdacq8dpskgain)
{
    ASSERT_ERR((((uint32_t)txdacq8dpskgain << 20) & ~((uint32_t)0x00700000)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00700000)) | ((uint32_t)txdacq8dpskgain << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_txdaci_8dpsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_txdaci_8dpsk_gain_setf(uint8_t txdaci8dpskgain)
{
    ASSERT_ERR((((uint32_t)txdaci8dpskgain << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)txdaci8dpskgain << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_txdacq_dqpsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_txdacq_dqpsk_gain_setf(uint8_t txdacqdqpskgain)
{
    ASSERT_ERR((((uint32_t)txdacqdqpskgain << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)txdacqdqpskgain << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_txdaci_dqpsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__STATIC_FORCEINLINE void rpl_txdaci_dqpsk_gain_setf(uint8_t txdacidqpskgain)
{
    ASSERT_ERR((((uint32_t)txdacidqpskgain << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)txdacidqpskgain << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_txdacq_gfsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

__STATIC_FORCEINLINE void rpl_txdacq_gfsk_gain_setf(uint8_t txdacqgfskgain)
{
    ASSERT_ERR((((uint32_t)txdacqgfskgain << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000070)) | ((uint32_t)txdacqgfskgain << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_txdaci_gfsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__STATIC_FORCEINLINE void rpl_txdaci_gfsk_gain_setf(uint8_t txdacigfskgain)
{
    ASSERT_ERR((((uint32_t)txdacigfskgain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)txdacigfskgain << 0));
}

/**
 * @brief CRM_CNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         FORCE_RESETS   0
 *     30    FORCE_CLOCK_GATES   0
 *     28      DAP_TXDC_RST_EN   0
 *     27     RPLL_FDIV_RST_EN   0
 *     26           MDM_RST_EN   0
 *     25            DB_RST_EN   0
 *     24           AGC_RST_EN   0
 *     23            SD_RST_EN   0
 *     22   GFSK_PREFILT_RST_EN   0
 *     21     DAP_CALIB_RST_EN   0
 *     20           DAP_RST_EN   0
 *     18   DAP_TXDC_CLK_GATE_EN   0
 *     17   RPLL_FDIV_CLK_GATE_EN   0
 *     16   SAR_ADC_CLK_GATE_EN   0
 *     15   MDM_TXDPSK13_CLK_GATE_EN   0
 *     14   MDM_TXGFSK13_CLK_GATE_EN   0
 *     13   MDM_TX13_CLK_GATE_EN   0
 *     12   MDM_RXDPSK13_CLK_GATE_EN   0
 *     11   MDM_RXDPSK52_CLK_GATE_EN   0
 *     10   MDM_RXDL13_CLK_GATE_EN   0
 *     09   MDM_RXGFSK13_CLK_GATE_EN   0
 *     08   MDM_RXGFSK52_CLK_GATE_EN   0
 *     07   MDM_RX52_CLK_GATE_EN   0
 *     06   MDM_CORE13_CLK_GATE_EN   0
 *     05       DB_CLK_GATE_EN   0
 *     04      AGC_CLK_GATE_EN   0
 *     03       SD_CLK_GATE_EN   0
 *     02   GFSK_PREFILT_CLK_GATE_EN   0
 *     01   DAP_CALIB_CLK_GATE_EN   0
 *     00      DAP_CLK_GATE_EN   0
 * </pre>
 */
#define RPL_CRM_CNTL0_ADDR   0x0000006B
#define RPL_CRM_CNTL0_OFFSET 0x0000006B
#define RPL_CRM_CNTL0_INDEX  0x0000006B
#define RPL_CRM_CNTL0_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_crm_cntl0_get(void)
{
    return REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
}

__STATIC_FORCEINLINE void rpl_crm_cntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, value);
}

// field definitions
#define RPL_FORCE_RESETS_BIT                ((uint32_t)0x80000000)
#define RPL_FORCE_RESETS_POS                31
#define RPL_FORCE_CLOCK_GATES_BIT           ((uint32_t)0x40000000)
#define RPL_FORCE_CLOCK_GATES_POS           30
#define RPL_DAP_TXDC_RST_EN_BIT             ((uint32_t)0x10000000)
#define RPL_DAP_TXDC_RST_EN_POS             28
#define RPL_RPLL_FDIV_RST_EN_BIT            ((uint32_t)0x08000000)
#define RPL_RPLL_FDIV_RST_EN_POS            27
#define RPL_MDM_RST_EN_BIT                  ((uint32_t)0x04000000)
#define RPL_MDM_RST_EN_POS                  26
#define RPL_DB_RST_EN_BIT                   ((uint32_t)0x02000000)
#define RPL_DB_RST_EN_POS                   25
#define RPL_AGC_RST_EN_BIT                  ((uint32_t)0x01000000)
#define RPL_AGC_RST_EN_POS                  24
#define RPL_SD_RST_EN_BIT                   ((uint32_t)0x00800000)
#define RPL_SD_RST_EN_POS                   23
#define RPL_GFSK_PREFILT_RST_EN_BIT         ((uint32_t)0x00400000)
#define RPL_GFSK_PREFILT_RST_EN_POS         22
#define RPL_DAP_CALIB_RST_EN_BIT            ((uint32_t)0x00200000)
#define RPL_DAP_CALIB_RST_EN_POS            21
#define RPL_DAP_RST_EN_BIT                  ((uint32_t)0x00100000)
#define RPL_DAP_RST_EN_POS                  20
#define RPL_DAP_TXDC_CLK_GATE_EN_BIT        ((uint32_t)0x00040000)
#define RPL_DAP_TXDC_CLK_GATE_EN_POS        18
#define RPL_RPLL_FDIV_CLK_GATE_EN_BIT       ((uint32_t)0x00020000)
#define RPL_RPLL_FDIV_CLK_GATE_EN_POS       17
#define RPL_SAR_ADC_CLK_GATE_EN_BIT         ((uint32_t)0x00010000)
#define RPL_SAR_ADC_CLK_GATE_EN_POS         16
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00008000)
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_POS    15
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00004000)
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_POS    14
#define RPL_MDM_TX13_CLK_GATE_EN_BIT        ((uint32_t)0x00002000)
#define RPL_MDM_TX13_CLK_GATE_EN_POS        13
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00001000)
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_POS    12
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_BIT    ((uint32_t)0x00000800)
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_POS    11
#define RPL_MDM_RXDL13_CLK_GATE_EN_BIT      ((uint32_t)0x00000400)
#define RPL_MDM_RXDL13_CLK_GATE_EN_POS      10
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00000200)
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_POS    9
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_BIT    ((uint32_t)0x00000100)
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_POS    8
#define RPL_MDM_RX52_CLK_GATE_EN_BIT        ((uint32_t)0x00000080)
#define RPL_MDM_RX52_CLK_GATE_EN_POS        7
#define RPL_MDM_CORE13_CLK_GATE_EN_BIT      ((uint32_t)0x00000040)
#define RPL_MDM_CORE13_CLK_GATE_EN_POS      6
#define RPL_DB_CLK_GATE_EN_BIT              ((uint32_t)0x00000020)
#define RPL_DB_CLK_GATE_EN_POS              5
#define RPL_AGC_CLK_GATE_EN_BIT             ((uint32_t)0x00000010)
#define RPL_AGC_CLK_GATE_EN_POS             4
#define RPL_SD_CLK_GATE_EN_BIT              ((uint32_t)0x00000008)
#define RPL_SD_CLK_GATE_EN_POS              3
#define RPL_GFSK_PREFILT_CLK_GATE_EN_BIT    ((uint32_t)0x00000004)
#define RPL_GFSK_PREFILT_CLK_GATE_EN_POS    2
#define RPL_DAP_CALIB_CLK_GATE_EN_BIT       ((uint32_t)0x00000002)
#define RPL_DAP_CALIB_CLK_GATE_EN_POS       1
#define RPL_DAP_CLK_GATE_EN_BIT             ((uint32_t)0x00000001)
#define RPL_DAP_CLK_GATE_EN_POS             0

#define RPL_FORCE_RESETS_RST                0x0
#define RPL_FORCE_CLOCK_GATES_RST           0x0
#define RPL_DAP_TXDC_RST_EN_RST             0x0
#define RPL_RPLL_FDIV_RST_EN_RST            0x0
#define RPL_MDM_RST_EN_RST                  0x0
#define RPL_DB_RST_EN_RST                   0x0
#define RPL_AGC_RST_EN_RST                  0x0
#define RPL_SD_RST_EN_RST                   0x0
#define RPL_GFSK_PREFILT_RST_EN_RST         0x0
#define RPL_DAP_CALIB_RST_EN_RST            0x0
#define RPL_DAP_RST_EN_RST                  0x0
#define RPL_DAP_TXDC_CLK_GATE_EN_RST        0x0
#define RPL_RPLL_FDIV_CLK_GATE_EN_RST       0x0
#define RPL_SAR_ADC_CLK_GATE_EN_RST         0x0
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_TX13_CLK_GATE_EN_RST        0x0
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXDL13_CLK_GATE_EN_RST      0x0
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RX52_CLK_GATE_EN_RST        0x0
#define RPL_MDM_CORE13_CLK_GATE_EN_RST      0x0
#define RPL_DB_CLK_GATE_EN_RST              0x0
#define RPL_AGC_CLK_GATE_EN_RST             0x0
#define RPL_SD_CLK_GATE_EN_RST              0x0
#define RPL_GFSK_PREFILT_CLK_GATE_EN_RST    0x0
#define RPL_DAP_CALIB_CLK_GATE_EN_RST       0x0
#define RPL_DAP_CLK_GATE_EN_RST             0x0

__STATIC_FORCEINLINE void rpl_crm_cntl0_pack(uint8_t forceresets, uint8_t forceclockgates, uint8_t daptxdcrsten, uint8_t rpllfdivrsten, uint8_t mdmrsten, uint8_t dbrsten, uint8_t agcrsten, uint8_t sdrsten, uint8_t gfskprefiltrsten, uint8_t dapcalibrsten, uint8_t daprsten, uint8_t daptxdcclkgateen, uint8_t rpllfdivclkgateen, uint8_t saradcclkgateen, uint8_t mdmtxdpsk13clkgateen, uint8_t mdmtxgfsk13clkgateen, uint8_t mdmtx13clkgateen, uint8_t mdmrxdpsk13clkgateen, uint8_t mdmrxdpsk52clkgateen, uint8_t mdmrxdl13clkgateen, uint8_t mdmrxgfsk13clkgateen, uint8_t mdmrxgfsk52clkgateen, uint8_t mdmrx52clkgateen, uint8_t mdmcore13clkgateen, uint8_t dbclkgateen, uint8_t agcclkgateen, uint8_t sdclkgateen, uint8_t gfskprefiltclkgateen, uint8_t dapcalibclkgateen, uint8_t dapclkgateen)
{
    ASSERT_ERR((((uint32_t)forceresets << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)forceclockgates << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)daptxdcrsten << 28) & ~((uint32_t)0x10000000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfdivrsten << 27) & ~((uint32_t)0x08000000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrsten << 26) & ~((uint32_t)0x04000000)) == 0);
    ASSERT_ERR((((uint32_t)dbrsten << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)agcrsten << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)sdrsten << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)gfskprefiltrsten << 22) & ~((uint32_t)0x00400000)) == 0);
    ASSERT_ERR((((uint32_t)dapcalibrsten << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)daprsten << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)daptxdcclkgateen << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfdivclkgateen << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)saradcclkgateen << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtxdpsk13clkgateen << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtxgfsk13clkgateen << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtx13clkgateen << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdpsk13clkgateen << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdpsk52clkgateen << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdl13clkgateen << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxgfsk13clkgateen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxgfsk52clkgateen << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)mdmrx52clkgateen << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)mdmcore13clkgateen << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)dbclkgateen << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)agcclkgateen << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)sdclkgateen << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)gfskprefiltclkgateen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dapcalibclkgateen << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dapclkgateen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR,  ((uint32_t)forceresets << 31) | ((uint32_t)forceclockgates << 30) | ((uint32_t)daptxdcrsten << 28) | ((uint32_t)rpllfdivrsten << 27) | ((uint32_t)mdmrsten << 26) | ((uint32_t)dbrsten << 25) | ((uint32_t)agcrsten << 24) | ((uint32_t)sdrsten << 23) | ((uint32_t)gfskprefiltrsten << 22) | ((uint32_t)dapcalibrsten << 21) | ((uint32_t)daprsten << 20) | ((uint32_t)daptxdcclkgateen << 18) | ((uint32_t)rpllfdivclkgateen << 17) | ((uint32_t)saradcclkgateen << 16) | ((uint32_t)mdmtxdpsk13clkgateen << 15) | ((uint32_t)mdmtxgfsk13clkgateen << 14) | ((uint32_t)mdmtx13clkgateen << 13) | ((uint32_t)mdmrxdpsk13clkgateen << 12) | ((uint32_t)mdmrxdpsk52clkgateen << 11) | ((uint32_t)mdmrxdl13clkgateen << 10) | ((uint32_t)mdmrxgfsk13clkgateen << 9) | ((uint32_t)mdmrxgfsk52clkgateen << 8) | ((uint32_t)mdmrx52clkgateen << 7) | ((uint32_t)mdmcore13clkgateen << 6) | ((uint32_t)dbclkgateen << 5) | ((uint32_t)agcclkgateen << 4) | ((uint32_t)sdclkgateen << 3) | ((uint32_t)gfskprefiltclkgateen << 2) | ((uint32_t)dapcalibclkgateen << 1) | ((uint32_t)dapclkgateen << 0));
}

__STATIC_FORCEINLINE void rpl_crm_cntl0_unpack(uint8_t* forceresets, uint8_t* forceclockgates, uint8_t* daptxdcrsten, uint8_t* rpllfdivrsten, uint8_t* mdmrsten, uint8_t* dbrsten, uint8_t* agcrsten, uint8_t* sdrsten, uint8_t* gfskprefiltrsten, uint8_t* dapcalibrsten, uint8_t* daprsten, uint8_t* daptxdcclkgateen, uint8_t* rpllfdivclkgateen, uint8_t* saradcclkgateen, uint8_t* mdmtxdpsk13clkgateen, uint8_t* mdmtxgfsk13clkgateen, uint8_t* mdmtx13clkgateen, uint8_t* mdmrxdpsk13clkgateen, uint8_t* mdmrxdpsk52clkgateen, uint8_t* mdmrxdl13clkgateen, uint8_t* mdmrxgfsk13clkgateen, uint8_t* mdmrxgfsk52clkgateen, uint8_t* mdmrx52clkgateen, uint8_t* mdmcore13clkgateen, uint8_t* dbclkgateen, uint8_t* agcclkgateen, uint8_t* sdclkgateen, uint8_t* gfskprefiltclkgateen, uint8_t* dapcalibclkgateen, uint8_t* dapclkgateen)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);

    *forceresets = (localVal & ((uint32_t)0x80000000)) >> 31;
    *forceclockgates = (localVal & ((uint32_t)0x40000000)) >> 30;
    *daptxdcrsten = (localVal & ((uint32_t)0x10000000)) >> 28;
    *rpllfdivrsten = (localVal & ((uint32_t)0x08000000)) >> 27;
    *mdmrsten = (localVal & ((uint32_t)0x04000000)) >> 26;
    *dbrsten = (localVal & ((uint32_t)0x02000000)) >> 25;
    *agcrsten = (localVal & ((uint32_t)0x01000000)) >> 24;
    *sdrsten = (localVal & ((uint32_t)0x00800000)) >> 23;
    *gfskprefiltrsten = (localVal & ((uint32_t)0x00400000)) >> 22;
    *dapcalibrsten = (localVal & ((uint32_t)0x00200000)) >> 21;
    *daprsten = (localVal & ((uint32_t)0x00100000)) >> 20;
    *daptxdcclkgateen = (localVal & ((uint32_t)0x00040000)) >> 18;
    *rpllfdivclkgateen = (localVal & ((uint32_t)0x00020000)) >> 17;
    *saradcclkgateen = (localVal & ((uint32_t)0x00010000)) >> 16;
    *mdmtxdpsk13clkgateen = (localVal & ((uint32_t)0x00008000)) >> 15;
    *mdmtxgfsk13clkgateen = (localVal & ((uint32_t)0x00004000)) >> 14;
    *mdmtx13clkgateen = (localVal & ((uint32_t)0x00002000)) >> 13;
    *mdmrxdpsk13clkgateen = (localVal & ((uint32_t)0x00001000)) >> 12;
    *mdmrxdpsk52clkgateen = (localVal & ((uint32_t)0x00000800)) >> 11;
    *mdmrxdl13clkgateen = (localVal & ((uint32_t)0x00000400)) >> 10;
    *mdmrxgfsk13clkgateen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *mdmrxgfsk52clkgateen = (localVal & ((uint32_t)0x00000100)) >> 8;
    *mdmrx52clkgateen = (localVal & ((uint32_t)0x00000080)) >> 7;
    *mdmcore13clkgateen = (localVal & ((uint32_t)0x00000040)) >> 6;
    *dbclkgateen = (localVal & ((uint32_t)0x00000020)) >> 5;
    *agcclkgateen = (localVal & ((uint32_t)0x00000010)) >> 4;
    *sdclkgateen = (localVal & ((uint32_t)0x00000008)) >> 3;
    *gfskprefiltclkgateen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dapcalibclkgateen = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dapclkgateen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

