dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_mdm_txdpsk13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__STATIC_FORCEINLINE void rpl_mdm_txdpsk13_clk_gate_en_setf(uint8_t mdmtxdpsk13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmtxdpsk13clkgateen << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)mdmtxdpsk13clkgateen << 15));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_txgfsk13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__STATIC_FORCEINLINE void rpl_mdm_txgfsk13_clk_gate_en_setf(uint8_t mdmtxgfsk13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmtxgfsk13clkgateen << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)mdmtxgfsk13clkgateen << 14));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_tx13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__STATIC_FORCEINLINE void rpl_mdm_tx13_clk_gate_en_setf(uint8_t mdmtx13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmtx13clkgateen << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)mdmtx13clkgateen << 13));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rxdpsk13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_mdm_rxdpsk13_clk_gate_en_setf(uint8_t mdmrxdpsk13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrxdpsk13clkgateen << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)mdmrxdpsk13clkgateen << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rxdpsk52_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_mdm_rxdpsk52_clk_gate_en_setf(uint8_t mdmrxdpsk52clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrxdpsk52clkgateen << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)mdmrxdpsk52clkgateen << 11));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rxdl13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__STATIC_FORCEINLINE void rpl_mdm_rxdl13_clk_gate_en_setf(uint8_t mdmrxdl13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrxdl13clkgateen << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)mdmrxdl13clkgateen << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rxgfsk13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_mdm_rxgfsk13_clk_gate_en_setf(uint8_t mdmrxgfsk13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrxgfsk13clkgateen << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)mdmrxgfsk13clkgateen << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rxgfsk52_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_mdm_rxgfsk52_clk_gate_en_setf(uint8_t mdmrxgfsk52clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrxgfsk52clkgateen << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)mdmrxgfsk52clkgateen << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rx52_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__STATIC_FORCEINLINE void rpl_mdm_rx52_clk_gate_en_setf(uint8_t mdmrx52clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmrx52clkgateen << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)mdmrx52clkgateen << 7));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_core13_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_FORCEINLINE void rpl_mdm_core13_clk_gate_en_setf(uint8_t mdmcore13clkgateen)
{
    ASSERT_ERR((((uint32_t)mdmcore13clkgateen << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)mdmcore13clkgateen << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_db_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__STATIC_FORCEINLINE void rpl_db_clk_gate_en_setf(uint8_t dbclkgateen)
{
    ASSERT_ERR((((uint32_t)dbclkgateen << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)dbclkgateen << 5));
}

__STATIC_FORCEINLINE uint8_t rpl_agc_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_FORCEINLINE void rpl_agc_clk_gate_en_setf(uint8_t agcclkgateen)
{
    ASSERT_ERR((((uint32_t)agcclkgateen << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)agcclkgateen << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_sd_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

