dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_force_adda_rst_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__STATIC_FORCEINLINE void rpl_force_adda_rst_setf(uint8_t forceaddarst)
{
    ASSERT_ERR((((uint32_t)forceaddarst << 29) & ~((uint32_t)0x20000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x20000000)) | ((uint32_t)forceaddarst << 29));
}

__STATIC_FORCEINLINE uint8_t rpl_rssi_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__STATIC_FORCEINLINE void rpl_rssi_clk_inv_en_setf(uint8_t rssiclkinven)
{
    ASSERT_ERR((((uint32_t)rssiclkinven << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)rssiclkinven << 25));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_rxadc_clk_inv_en_setf(uint8_t rxadcclkinven)
{
    ASSERT_ERR((((uint32_t)rxadcclkinven << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)rxadcclkinven << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_n_ldo_adda_rst_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__STATIC_FORCEINLINE void rpl_n_ldo_adda_rst_setf(uint8_t nldoaddarst)
{
    ASSERT_ERR((((uint32_t)nldoaddarst << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)nldoaddarst << 18));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_satdet_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__STATIC_FORCEINLINE void rpl_rxadc_satdet_en_setf(uint8_t rxadcsatdeten)
{
    ASSERT_ERR((((uint32_t)rxadcsatdeten << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)rxadcsatdeten << 13));
}

__STATIC_FORCEINLINE uint8_t rpl_modem_rx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_modem_rx_en_setf(uint8_t modemrxen)
{
    ASSERT_ERR((((uint32_t)modemrxen << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)modemrxen << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_rxadc_en_setf(uint8_t rxadcen)
{
    ASSERT_ERR((((uint32_t)rxadcen << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)rxadcen << 11));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__STATIC_FORCEINLINE void rpl_rxadc_on_setf(uint8_t rxadcon)
{
    ASSERT_ERR((((uint32_t)rxadcon << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)rxadcon << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_agc_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_agc_en_setf(uint8_t agcen)
{
    ASSERT_ERR((((uint32_t)agcen << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)agcen << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_rssi_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rssi_on_setf(uint8_t rssion)
{
    ASSERT_ERR((((uint32_t)rssion << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)rssion << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rxfilt_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__STATIC_FORCEINLINE void rpl_rxfilt_on_setf(uint8_t rxfilton)
{
    ASSERT_ERR((((uint32_t)rxfilton << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)rxfilton << 7));
}

__STATIC_FORCEINLINE uint8_t rpl_rxlobuf_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_FORCEINLINE void rpl_rxlobuf_on_setf(uint8_t rxlobufon)
{
    ASSERT_ERR((((uint32_t)rxlobufon << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)rxlobufon << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_rxmix_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__STATIC_FORCEINLINE void rpl_rxmix_on_setf(uint8_t rxmixon)
{
    ASSERT_ERR((((uint32_t)rxmixon << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)rxmixon << 5));
}

__STATIC_FORCEINLINE uint8_t rpl_rxlna_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_FORCEINLINE void rpl_rxlna_on_setf(uint8_t rxlnaon)
{
    ASSERT_ERR((((uint32_t)rxlnaon << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)rxlnaon << 4));
}

