dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rxlna_cfg_setf(uint8_t rxlnacfg)
{
    ASSERT_ERR((((uint32_t)rxlnacfg << 20) & ~((uint32_t)0x00300000)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFRXCONFIG_ADDR) & ~((uint32_t)0x00300000)) | ((uint32_t)rxlnacfg << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_rxfilt_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_rxfilt_cfg_setf(uint8_t rxfiltcfg)
{
    ASSERT_ERR((((uint32_t)rxfiltcfg << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFRXCONFIG_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)rxfiltcfg << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rxadc_cfg_setf(uint8_t rxadccfg)
{
    ASSERT_ERR((((uint32_t)rxadccfg << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFRXCONFIG_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)rxadccfg << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rssi_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rssi_cfg_setf(uint8_t rssicfg)
{
    ASSERT_ERR((((uint32_t)rssicfg << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFRXCONFIG_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rssicfg << 0));
}

/**
 * @brief RFTXCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         TXCTRL_FORCE   0
 *     30    TXGAIN_GFSK_FORCE   0
 *     29     TXGAIN_EDR_FORCE   0
 *     27     TXDAC_CLK_INV_EN   0
 *     26   TXDC_CAL_TIMEOUT_DSB   0
 *     25          TXDC_CAL_EN   0
 *     24       TXDC_CAL_START   0
 *     21           SD_FIFO_EN   0
 *     20          RAMP_GEN_EN   0
 *     19          MODEM_TX_EN   0
 *     18            FMTX2P_ON   0
 *     17           TXFILTQ_ON   0
 *     16           TXFILTI_ON   0
 *     15            TXDACQ_ON   0
 *     14            TXDACI_ON   0
 *     13              FMTX_ON   0
 *     12              TXPA_ON   0
 *     11             TXPA_SEL   0
 *     10       TXRF_DETECT_ON   0
 *     09             TXMIX_ON   0
 *     08           TXLOBUF_ON   0
 *  07:04       TXGAIN_EDR_SEL   0x0
 *  03:00      TXGAIN_GFSK_SEL   0x0
 * </pre>
 */
#define RPL_RFTXCNTL0_ADDR   0x0000006F
#define RPL_RFTXCNTL0_OFFSET 0x0000006F
#define RPL_RFTXCNTL0_INDEX  0x0000006F
#define RPL_RFTXCNTL0_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftxcntl0_get(void)
{
    return REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxcntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, value);
}

// field definitions
#define RPL_TXCTRL_FORCE_BIT            ((uint32_t)0x80000000)
#define RPL_TXCTRL_FORCE_POS            31
#define RPL_TXGAIN_GFSK_FORCE_BIT       ((uint32_t)0x40000000)
#define RPL_TXGAIN_GFSK_FORCE_POS       30
#define RPL_TXGAIN_EDR_FORCE_BIT        ((uint32_t)0x20000000)
#define RPL_TXGAIN_EDR_FORCE_POS        29
#define RPL_TXDAC_CLK_INV_EN_BIT        ((uint32_t)0x08000000)
#define RPL_TXDAC_CLK_INV_EN_POS        27
#define RPL_TXDC_CAL_TIMEOUT_DSB_BIT    ((uint32_t)0x04000000)
#define RPL_TXDC_CAL_TIMEOUT_DSB_POS    26
#define RPL_TXDC_CAL_EN_BIT             ((uint32_t)0x02000000)
#define RPL_TXDC_CAL_EN_POS             25
#define RPL_TXDC_CAL_START_BIT          ((uint32_t)0x01000000)
#define RPL_TXDC_CAL_START_POS          24
#define RPL_SD_FIFO_EN_BIT              ((uint32_t)0x00200000)
#define RPL_SD_FIFO_EN_POS              21
#define RPL_RAMP_GEN_EN_BIT             ((uint32_t)0x00100000)
#define RPL_RAMP_GEN_EN_POS             20
#define RPL_MODEM_TX_EN_BIT             ((uint32_t)0x00080000)
#define RPL_MODEM_TX_EN_POS             19
#define RPL_FMTX2P_ON_BIT               ((uint32_t)0x00040000)
#define RPL_FMTX2P_ON_POS               18
#define RPL_TXFILTQ_ON_BIT              ((uint32_t)0x00020000)
#define RPL_TXFILTQ_ON_POS              17
#define RPL_TXFILTI_ON_BIT              ((uint32_t)0x00010000)
#define RPL_TXFILTI_ON_POS              16
#define RPL_TXDACQ_ON_BIT               ((uint32_t)0x00008000)
#define RPL_TXDACQ_ON_POS               15
#define RPL_TXDACI_ON_BIT               ((uint32_t)0x00004000)
#define RPL_TXDACI_ON_POS               14
#define RPL_FMTX_ON_BIT                 ((uint32_t)0x00002000)
#define RPL_FMTX_ON_POS                 13
#define RPL_TXPA_ON_BIT                 ((uint32_t)0x00001000)
#define RPL_TXPA_ON_POS                 12
#define RPL_TXPA_SEL_BIT                ((uint32_t)0x00000800)
#define RPL_TXPA_SEL_POS                11
#define RPL_TXRF_DETECT_ON_BIT          ((uint32_t)0x00000400)
#define RPL_TXRF_DETECT_ON_POS          10
#define RPL_TXMIX_ON_BIT                ((uint32_t)0x00000200)
#define RPL_TXMIX_ON_POS                9
#define RPL_TXLOBUF_ON_BIT              ((uint32_t)0x00000100)
#define RPL_TXLOBUF_ON_POS              8
#define RPL_TXGAIN_EDR_SEL_MASK         ((uint32_t)0x000000F0)
#define RPL_TXGAIN_EDR_SEL_LSB          4
#define RPL_TXGAIN_EDR_SEL_WIDTH        ((uint32_t)0x00000004)
#define RPL_TXGAIN_GFSK_SEL_MASK        ((uint32_t)0x0000000F)
#define RPL_TXGAIN_GFSK_SEL_LSB         0
#define RPL_TXGAIN_GFSK_SEL_WIDTH       ((uint32_t)0x00000004)

#define RPL_TXCTRL_FORCE_RST            0x0
#define RPL_TXGAIN_GFSK_FORCE_RST       0x0
#define RPL_TXGAIN_EDR_FORCE_RST        0x0
#define RPL_TXDAC_CLK_INV_EN_RST        0x0
#define RPL_TXDC_CAL_TIMEOUT_DSB_RST    0x0
#define RPL_TXDC_CAL_EN_RST             0x0
#define RPL_TXDC_CAL_START_RST          0x0
#define RPL_SD_FIFO_EN_RST              0x0
#define RPL_RAMP_GEN_EN_RST             0x0
#define RPL_MODEM_TX_EN_RST             0x0
#define RPL_FMTX2P_ON_RST               0x0
#define RPL_TXFILTQ_ON_RST              0x0
#define RPL_TXFILTI_ON_RST              0x0
#define RPL_TXDACQ_ON_RST               0x0
#define RPL_TXDACI_ON_RST               0x0
#define RPL_FMTX_ON_RST                 0x0
#define RPL_TXPA_ON_RST                 0x0
#define RPL_TXPA_SEL_RST                0x0
#define RPL_TXRF_DETECT_ON_RST          0x0
#define RPL_TXMIX_ON_RST                0x0
#define RPL_TXLOBUF_ON_RST              0x0
#define RPL_TXGAIN_EDR_SEL_RST          0x0
#define RPL_TXGAIN_GFSK_SEL_RST         0x0

__STATIC_FORCEINLINE void rpl_rftxcntl0_pack(uint8_t txctrlforce, uint8_t txgaingfskforce, uint8_t txgainedrforce, uint8_t txdacclkinven, uint8_t txdccaltimeoutdsb, uint8_t txdccalen, uint8_t txdccalstart, uint8_t sdfifoen, uint8_t rampgenen, uint8_t modemtxen, uint8_t fmtx2pon, uint8_t txfiltqon, uint8_t txfiltion, uint8_t txdacqon, uint8_t txdacion, uint8_t fmtxon, uint8_t txpaon, uint8_t txpasel, uint8_t txrfdetecton, uint8_t txmixon, uint8_t txlobufon, uint8_t txgainedrsel, uint8_t txgaingfsksel)
{
    ASSERT_ERR((((uint32_t)txctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txgaingfskforce << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)txgainedrforce << 29) & ~((uint32_t)0x20000000)) == 0);
    ASSERT_ERR((((uint32_t)txdacclkinven << 27) & ~((uint32_t)0x08000000)) == 0);
    ASSERT_ERR((((uint32_t)txdccaltimeoutdsb << 26) & ~((uint32_t)0x04000000)) == 0);
    ASSERT_ERR((((uint32_t)txdccalen << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)txdccalstart << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)sdfifoen << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)rampgenen << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)modemtxen << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)fmtx2pon << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)txfiltqon << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)txfiltion << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)txdacqon << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)txdacion << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)fmtxon << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)txpaon << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)txpasel << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)txrfdetecton << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)txmixon << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)txlobufon << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)txgainedrsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)txgaingfsksel << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR,  ((uint32_t)txctrlforce << 31) | ((uint32_t)txgaingfskforce << 30) | ((uint32_t)txgainedrforce << 29) | ((uint32_t)txdacclkinven << 27) | ((uint32_t)txdccaltimeoutdsb << 26) | ((uint32_t)txdccalen << 25) | ((uint32_t)txdccalstart << 24) | ((uint32_t)sdfifoen << 21) | ((uint32_t)rampgenen << 20) | ((uint32_t)modemtxen << 19) | ((uint32_t)fmtx2pon << 18) | ((uint32_t)txfiltqon << 17) | ((uint32_t)txfiltion << 16) | ((uint32_t)txdacqon << 15) | ((uint32_t)txdacion << 14) | ((uint32_t)fmtxon << 13) | ((uint32_t)txpaon << 12) | ((uint32_t)txpasel << 11) | ((uint32_t)txrfdetecton << 10) | ((uint32_t)txmixon << 9) | ((uint32_t)txlobufon << 8) | ((uint32_t)txgainedrsel << 4) | ((uint32_t)txgaingfsksel << 0));
}

__STATIC_FORCEINLINE void rpl_rftxcntl0_unpack(uint8_t* txctrlforce, uint8_t* txgaingfskforce, uint8_t* txgainedrforce, uint8_t* txdacclkinven, uint8_t* txdccaltimeoutdsb, uint8_t* txdccalen, uint8_t* txdccalstart, uint8_t* sdfifoen, uint8_t* rampgenen, uint8_t* modemtxen, uint8_t* fmtx2pon, uint8_t* txfiltqon, uint8_t* txfiltion, uint8_t* txdacqon, uint8_t* txdacion, uint8_t* fmtxon, uint8_t* txpaon, uint8_t* txpasel, uint8_t* txrfdetecton, uint8_t* txmixon, uint8_t* txlobufon, uint8_t* txgainedrsel, uint8_t* txgaingfsksel)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);

    *txctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txgaingfskforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *txgainedrforce = (localVal & ((uint32_t)0x20000000)) >> 29;
    *txdacclkinven = (localVal & ((uint32_t)0x08000000)) >> 27;
    *txdccaltimeoutdsb = (localVal & ((uint32_t)0x04000000)) >> 26;
    *txdccalen = (localVal & ((uint32_t)0x02000000)) >> 25;
    *txdccalstart = (localVal & ((uint32_t)0x01000000)) >> 24;
    *sdfifoen = (localVal & ((uint32_t)0x00200000)) >> 21;
    *rampgenen = (localVal & ((uint32_t)0x00100000)) >> 20;
    *modemtxen = (localVal & ((uint32_t)0x00080000)) >> 19;
    *fmtx2pon = (localVal & ((uint32_t)0x00040000)) >> 18;
    *txfiltqon = (localVal & ((uint32_t)0x00020000)) >> 17;
    *txfiltion = (localVal & ((uint32_t)0x00010000)) >> 16;
    *txdacqon = (localVal & ((uint32_t)0x00008000)) >> 15;
    *txdacion = (localVal & ((uint32_t)0x00004000)) >> 14;
    *fmtxon = (localVal & ((uint32_t)0x00002000)) >> 13;
    *txpaon = (localVal & ((uint32_t)0x00001000)) >> 12;
    *txpasel = (localVal & ((uint32_t)0x00000800)) >> 11;
    *txrfdetecton = (localVal & ((uint32_t)0x00000400)) >> 10;
    *txmixon = (localVal & ((uint32_t)0x00000200)) >> 9;
    *txlobufon = (localVal & ((uint32_t)0x00000100)) >> 8;
    *txgainedrsel = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *txgaingfsksel = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

