dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_txpa_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_txpa_sel_setf(uint8_t txpasel)
{
    ASSERT_ERR((((uint32_t)txpasel << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)txpasel << 11));
}

__STATIC_FORCEINLINE uint8_t rpl_txrf_detect_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__STATIC_FORCEINLINE void rpl_txrf_detect_on_setf(uint8_t txrfdetecton)
{
    ASSERT_ERR((((uint32_t)txrfdetecton << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)txrfdetecton << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_txmix_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_txmix_on_setf(uint8_t txmixon)
{
    ASSERT_ERR((((uint32_t)txmixon << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)txmixon << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_txlobuf_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_txlobuf_on_setf(uint8_t txlobufon)
{
    ASSERT_ERR((((uint32_t)txlobufon << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)txlobufon << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_txgain_edr_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__STATIC_FORCEINLINE void rpl_txgain_edr_sel_setf(uint8_t txgainedrsel)
{
    ASSERT_ERR((((uint32_t)txgainedrsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)txgainedrsel << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_txgain_gfsk_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__STATIC_FORCEINLINE void rpl_txgain_gfsk_sel_setf(uint8_t txgaingfsksel)
{
    ASSERT_ERR((((uint32_t)txgaingfsksel << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)txgaingfsksel << 0));
}

/**
 * @brief RFTXCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31           TXDC_FORCE   0
 *  12:08               TXDC_Q   0x0
 *  04:00               TXDC_I   0x0
 * </pre>
 */
#define RPL_RFTXCNTL1_ADDR   0x00000070
#define RPL_RFTXCNTL1_OFFSET 0x00000070
#define RPL_RFTXCNTL1_INDEX  0x00000070
#define RPL_RFTXCNTL1_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftxcntl1_get(void)
{
    return REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, value);
}

// field definitions
#define RPL_TXDC_FORCE_BIT    ((uint32_t)0x80000000)
#define RPL_TXDC_FORCE_POS    31
#define RPL_TXDC_Q_MASK       ((uint32_t)0x00001F00)
#define RPL_TXDC_Q_LSB        8
#define RPL_TXDC_Q_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDC_I_MASK       ((uint32_t)0x0000001F)
#define RPL_TXDC_I_LSB        0
#define RPL_TXDC_I_WIDTH      ((uint32_t)0x00000005)

#define RPL_TXDC_FORCE_RST    0x0
#define RPL_TXDC_Q_RST        0x0
#define RPL_TXDC_I_RST        0x0

__STATIC_FORCEINLINE void rpl_rftxcntl1_pack(uint8_t txdcforce, uint8_t txdcq, uint8_t txdci)
{
    ASSERT_ERR((((uint32_t)txdcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdcq << 8) & ~((uint32_t)0x00001F00)) == 0);
    ASSERT_ERR((((uint32_t)txdci << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR,  ((uint32_t)txdcforce << 31) | ((uint32_t)txdcq << 8) | ((uint32_t)txdci << 0));
}

__STATIC_FORCEINLINE void rpl_rftxcntl1_unpack(uint8_t* txdcforce, uint8_t* txdcq, uint8_t* txdci)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);

    *txdcforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txdcq = (localVal & ((uint32_t)0x00001F00)) >> 8;
    *txdci = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_txdc_force_setf(uint8_t txdcforce)
{
    ASSERT_ERR((((uint32_t)txdcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txdcforce << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_q_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00001F00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_txdc_q_setf(uint8_t txdcq)
{
    ASSERT_ERR((((uint32_t)txdcq << 8) & ~((uint32_t)0x00001F00)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x00001F00)) | ((uint32_t)txdcq << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_i_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__STATIC_FORCEINLINE void rpl_txdc_i_setf(uint8_t txdci)
{
    ASSERT_ERR((((uint32_t)txdci << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)txdci << 0));
}

/**
 * @brief RFTXCONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         TXFILT_IF_EN   1
 *  27:20   TXDC_CAL_TIMEOUT_DELAY   0xFF
 *  19:16   FMTX2P_ON_DLYD_CNT   0x0
 *  15:14            FMTX_TRIM   0x0
 *  13:12           TXMIX_TRIM   0x0
 *  10:08           TXTANK_SEL   0x0
 *  07:04           TXFILT_CFG   0x0
 *  02:00             TXPA_CFG   0x0
 * </pre>
 */
#define RPL_RFTXCONFIG_ADDR   0x00000071
#define RPL_RFTXCONFIG_OFFSET 0x00000071
#define RPL_RFTXCONFIG_INDEX  0x00000071
#define RPL_RFTXCONFIG_RESET  0x8FF00000

__STATIC_FORCEINLINE uint32_t rpl_rftxconfig_get(void)
{
    return REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxconfig_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, value);
}

