dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint32_t rpl_rftxrxconfig_get(void)
{
    return REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxrxconfig_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, value);
}

// field definitions
#define RPL_DATA_BUS_POL_BIT             ((uint32_t)0x80000000)
#define RPL_DATA_BUS_POL_POS             31
#define RPL_ICP_CAL_DSB_BIT              ((uint32_t)0x40000000)
#define RPL_ICP_CAL_DSB_POS              30
#define RPL_CALIB_MODE_MASK              ((uint32_t)0x30000000)
#define RPL_CALIB_MODE_LSB               28
#define RPL_CALIB_MODE_WIDTH             ((uint32_t)0x00000002)
#define RPL_CALIB_TIMEOUT_DELAY_MASK     ((uint32_t)0x0FF00000)
#define RPL_CALIB_TIMEOUT_DELAY_LSB      20
#define RPL_CALIB_TIMEOUT_DELAY_WIDTH    ((uint32_t)0x00000008)
#define RPL_ICP_CAL_SETTLE_TIME_MASK     ((uint32_t)0x000FC000)
#define RPL_ICP_CAL_SETTLE_TIME_LSB      14
#define RPL_ICP_CAL_SETTLE_TIME_WIDTH    ((uint32_t)0x00000006)
#define RPL_VCOFC_CAL_SETTLE_TIME_MASK   ((uint32_t)0x00003F00)
#define RPL_VCOFC_CAL_SETTLE_TIME_LSB    8
#define RPL_VCOFC_CAL_SETTLE_TIME_WIDTH  ((uint32_t)0x00000006)
#define RPL_BB_BIAS_CFG_MASK             ((uint32_t)0x000000C0)
#define RPL_BB_BIAS_CFG_LSB              6
#define RPL_BB_BIAS_CFG_WIDTH            ((uint32_t)0x00000002)
#define RPL_DAP_CLK_MODE_BIT             ((uint32_t)0x00000010)
#define RPL_DAP_CLK_MODE_POS             4
#define RPL_LODIV2_TRIM_MASK             ((uint32_t)0x0000000C)
#define RPL_LODIV2_TRIM_LSB              2
#define RPL_LODIV2_TRIM_WIDTH            ((uint32_t)0x00000002)
#define RPL_LOBUF_TRIM_MASK              ((uint32_t)0x00000003)
#define RPL_LOBUF_TRIM_LSB               0
#define RPL_LOBUF_TRIM_WIDTH             ((uint32_t)0x00000002)

#define RPL_DATA_BUS_POL_RST             0x0
#define RPL_ICP_CAL_DSB_RST              0x0
#define RPL_CALIB_MODE_RST               0x2
#define RPL_CALIB_TIMEOUT_DELAY_RST      0xFF
#define RPL_ICP_CAL_SETTLE_TIME_RST      0x5
#define RPL_VCOFC_CAL_SETTLE_TIME_RST    0x5
#define RPL_BB_BIAS_CFG_RST              0x0
#define RPL_DAP_CLK_MODE_RST             0x0
#define RPL_LODIV2_TRIM_RST              0x0
#define RPL_LOBUF_TRIM_RST               0x0

__STATIC_FORCEINLINE void rpl_rftxrxconfig_pack(uint8_t databuspol, uint8_t icpcaldsb, uint8_t calibmode, uint8_t calibtimeoutdelay, uint8_t icpcalsettletime, uint8_t vcofccalsettletime, uint8_t bbbiascfg, uint8_t dapclkmode, uint8_t lodiv2trim, uint8_t lobuftrim)
{
    ASSERT_ERR((((uint32_t)databuspol << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)icpcaldsb << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)calibmode << 28) & ~((uint32_t)0x30000000)) == 0);
    ASSERT_ERR((((uint32_t)calibtimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    ASSERT_ERR((((uint32_t)icpcalsettletime << 14) & ~((uint32_t)0x000FC000)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalsettletime << 8) & ~((uint32_t)0x00003F00)) == 0);
    ASSERT_ERR((((uint32_t)bbbiascfg << 6) & ~((uint32_t)0x000000C0)) == 0);
    ASSERT_ERR((((uint32_t)dapclkmode << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)lodiv2trim << 2) & ~((uint32_t)0x0000000C)) == 0);
    ASSERT_ERR((((uint32_t)lobuftrim << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR,  ((uint32_t)databuspol << 31) | ((uint32_t)icpcaldsb << 30) | ((uint32_t)calibmode << 28) | ((uint32_t)calibtimeoutdelay << 20) | ((uint32_t)icpcalsettletime << 14) | ((uint32_t)vcofccalsettletime << 8) | ((uint32_t)bbbiascfg << 6) | ((uint32_t)dapclkmode << 4) | ((uint32_t)lodiv2trim << 2) | ((uint32_t)lobuftrim << 0));
}

__STATIC_FORCEINLINE void rpl_rftxrxconfig_unpack(uint8_t* databuspol, uint8_t* icpcaldsb, uint8_t* calibmode, uint8_t* calibtimeoutdelay, uint8_t* icpcalsettletime, uint8_t* vcofccalsettletime, uint8_t* bbbiascfg, uint8_t* dapclkmode, uint8_t* lodiv2trim, uint8_t* lobuftrim)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);

    *databuspol = (localVal & ((uint32_t)0x80000000)) >> 31;
    *icpcaldsb = (localVal & ((uint32_t)0x40000000)) >> 30;
    *calibmode = (localVal & ((uint32_t)0x30000000)) >> 28;
    *calibtimeoutdelay = (localVal & ((uint32_t)0x0FF00000)) >> 20;
    *icpcalsettletime = (localVal & ((uint32_t)0x000FC000)) >> 14;
    *vcofccalsettletime = (localVal & ((uint32_t)0x00003F00)) >> 8;
    *bbbiascfg = (localVal & ((uint32_t)0x000000C0)) >> 6;
    *dapclkmode = (localVal & ((uint32_t)0x00000010)) >> 4;
    *lodiv2trim = (localVal & ((uint32_t)0x0000000C)) >> 2;
    *lobuftrim = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_data_bus_pol_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_data_bus_pol_setf(uint8_t databuspol)
{
    ASSERT_ERR((((uint32_t)databuspol << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)databuspol << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_icp_cal_dsb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_icp_cal_dsb_setf(uint8_t icpcaldsb)
{
    ASSERT_ERR((((uint32_t)icpcaldsb << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)icpcaldsb << 30));
}

__STATIC_FORCEINLINE uint8_t rpl_calib_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

__STATIC_FORCEINLINE void rpl_calib_mode_setf(uint8_t calibmode)
{
    ASSERT_ERR((((uint32_t)calibmode << 28) & ~((uint32_t)0x30000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x30000000)) | ((uint32_t)calibmode << 28));
}

__STATIC_FORCEINLINE uint8_t rpl_calib_timeout_delay_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0FF00000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_calib_timeout_delay_setf(uint8_t calibtimeoutdelay)
{
    ASSERT_ERR((((uint32_t)calibtimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x0FF00000)) | ((uint32_t)calibtimeoutdelay << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_icp_cal_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000FC000)) >> 14);
}

__STATIC_FORCEINLINE void rpl_icp_cal_settle_time_setf(uint8_t icpcalsettletime)
{
    ASSERT_ERR((((uint32_t)icpcalsettletime << 14) & ~((uint32_t)0x000FC000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x000FC000)) | ((uint32_t)icpcalsettletime << 14));
}

__STATIC_FORCEINLINE uint8_t rpl_vcofc_cal_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

