dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_rxadc_satdet_thr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00007F00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rxadc_satdet_thr_setf(uint8_t rxadcsatdetthr)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetthr << 8) & ~((uint32_t)0x00007F00)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, (REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR) & ~((uint32_t)0x00007F00)) | ((uint32_t)rxadcsatdetthr << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rxadc_satdet_window_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rxadc_satdet_window_setf(uint8_t rxadcsatdetwindow)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetwindow << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, (REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR) & ~((uint32_t)0x0000007F)) | ((uint32_t)rxadcsatdetwindow << 0));
}

/**
 * @brief TXDC_DETECT_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31            TXDC_MODE   0
 *  25:16       TXDC_REF_VALUE   0x26E
 *  07:00     TXDC_SETTLE_TIME   0x17
 * </pre>
 */
#define RPL_TXDC_DETECT_CONFIG_ADDR   0x00000079
#define RPL_TXDC_DETECT_CONFIG_OFFSET 0x00000079
#define RPL_TXDC_DETECT_CONFIG_INDEX  0x00000079
#define RPL_TXDC_DETECT_CONFIG_RESET  0x026E0017

__STATIC_FORCEINLINE uint32_t rpl_txdc_detect_config_get(void)
{
    return REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
}

__STATIC_FORCEINLINE void rpl_txdc_detect_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, value);
}

// field definitions
#define RPL_TXDC_MODE_BIT           ((uint32_t)0x80000000)
#define RPL_TXDC_MODE_POS           31
#define RPL_TXDC_REF_VALUE_MASK     ((uint32_t)0x03FF0000)
#define RPL_TXDC_REF_VALUE_LSB      16
#define RPL_TXDC_REF_VALUE_WIDTH    ((uint32_t)0x0000000A)
#define RPL_TXDC_SETTLE_TIME_MASK   ((uint32_t)0x000000FF)
#define RPL_TXDC_SETTLE_TIME_LSB    0
#define RPL_TXDC_SETTLE_TIME_WIDTH  ((uint32_t)0x00000008)

#define RPL_TXDC_MODE_RST           0x0
#define RPL_TXDC_REF_VALUE_RST      0x26E
#define RPL_TXDC_SETTLE_TIME_RST    0x17

__STATIC_FORCEINLINE void rpl_txdc_detect_config_pack(uint8_t txdcmode, uint16_t txdcrefvalue, uint8_t txdcsettletime)
{
    ASSERT_ERR((((uint32_t)txdcmode << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdcrefvalue << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txdcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR,  ((uint32_t)txdcmode << 31) | ((uint32_t)txdcrefvalue << 16) | ((uint32_t)txdcsettletime << 0));
}

__STATIC_FORCEINLINE void rpl_txdc_detect_config_unpack(uint8_t* txdcmode, uint16_t* txdcrefvalue, uint8_t* txdcsettletime)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);

    *txdcmode = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txdcrefvalue = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *txdcsettletime = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_txdc_mode_setf(uint8_t txdcmode)
{
    ASSERT_ERR((((uint32_t)txdcmode << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txdcmode << 31));
}

__STATIC_FORCEINLINE uint16_t rpl_txdc_ref_value_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_txdc_ref_value_setf(uint16_t txdcrefvalue)
{
    ASSERT_ERR((((uint32_t)txdcrefvalue << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)txdcrefvalue << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_txdc_settle_time_setf(uint8_t txdcsettletime)
{
    ASSERT_ERR((((uint32_t)txdcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)txdcsettletime << 0));
}

/**
 * @brief TESTMUXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08            MUX1_CTRL   0x1
 *  07:00            MUX0_CTRL   0x0
 * </pre>
 */
#define RPL_TESTMUXCNTL_ADDR   0x0000007A
#define RPL_TESTMUXCNTL_OFFSET 0x0000007A
#define RPL_TESTMUXCNTL_INDEX  0x0000007A
#define RPL_TESTMUXCNTL_RESET  0x00000100

__STATIC_FORCEINLINE uint32_t rpl_testmuxcntl_get(void)
{
    return REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_testmuxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR, value);
}

// field definitions
#define RPL_MUX1_CTRL_MASK   ((uint32_t)0x0000FF00)
#define RPL_MUX1_CTRL_LSB    8
#define RPL_MUX1_CTRL_WIDTH  ((uint32_t)0x00000008)
#define RPL_MUX0_CTRL_MASK   ((uint32_t)0x000000FF)
#define RPL_MUX0_CTRL_LSB    0
#define RPL_MUX0_CTRL_WIDTH  ((uint32_t)0x00000008)

#define RPL_MUX1_CTRL_RST    0x1
#define RPL_MUX0_CTRL_RST    0x0

__STATIC_FORCEINLINE void rpl_testmuxcntl_pack(uint8_t mux1ctrl, uint8_t mux0ctrl)
{
    ASSERT_ERR((((uint32_t)mux1ctrl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)mux0ctrl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR,  ((uint32_t)mux1ctrl << 8) | ((uint32_t)mux0ctrl << 0));
}

__STATIC_FORCEINLINE void rpl_testmuxcntl_unpack(uint8_t* mux1ctrl, uint8_t* mux0ctrl)
{
    uint32_t localVal = REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);

    *mux1ctrl = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *mux0ctrl = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_mux1_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_mux1_ctrl_setf(uint8_t mux1ctrl)
{
    ASSERT_ERR((((uint32_t)mux1ctrl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR, (REG_RPL_RD(RPL_TESTMUXCNTL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)mux1ctrl << 8));
}

